/*
 *   Mitsubishi CP-9xxx Photo Printer Family CUPS backend
 *
 *   (c) 2014-2021 Solomon Peachy <pizza@shaftnet.org>
 *
 *   The latest version of this program can be found at:
 *
 *     https://git.shaftnet.org/cgit/selphy_print.git
 *
 *   This program is free software; you can redistribute it and/or modify it
 *   under the terms of the GNU General Public License as published by the Free
 *   Software Foundation; either version 2 of the License, or (at your option)
 *   any later version.
 *
 *   This program is distributed in the hope that it will be useful, but
 *   WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 *   or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 *   for more details.
 *
 *   You should have received a copy of the GNU General Public License
 *   along with this program; if not, see <https://www.gnu.org/licenses/>.
 *
 *   SPDX-License-Identifier: GPL-2.0+
 *
 */

#define BACKEND mitsu9550_backend

#include "backend_common.h"
#include "backend_mitsu.h"

#define MITSU_M98xx_LAMINATE_FILE  "M98MATTE.raw"
#define MITSU_M98xx_DATATABLE_FILE "M98TABLE.dat"
#define MITSU_M98xx_LUT_FILE       "M98XXL01.lut"
#define MITSU_CP30D_LUT_FILE       "CP30LT_1.lut"
#define LAMINATE_STRIDE 1868

/* Spool file structures */

/* Print parameters1 */
struct mitsu9550_hdr1 {
	uint8_t  cmd[4];  /* 1b 57 20 2e */
	uint8_t  unk[10]; /* 00 0a 10 00 [...] */
	uint16_t cols;    /* BE */
	uint16_t rows;    /* BE */
	uint8_t  matte;   /* CP9810/9820 only. 01 for matte, 00 glossy */
	uint8_t  null[31];
} __attribute__((packed));

/* Print parameters2 */
struct mitsu9550_hdr2 {
	uint8_t  cmd[4];   /* 1b 57 21 2e */
	uint8_t  unk[24];  /* 00 80 00 22 08 03 [...] */
	uint16_t copies;   /* BE, 1-680 */
	uint8_t  null[2];
	uint8_t  cut;      /* 00 == normal, 83 == 2x6*2 */
	uint8_t  unkb[5];
	uint8_t  mode;     /* 00 == fine, 80 == superfine */
	uint8_t  unkc[11]; /* 00 [...] 00 01 ; note [7][8][9] are cp98xx extensions for sharpness/reversed/lut */
} __attribute__((packed));

/* Fine Deep selection (9550 only) */
struct mitsu9550_hdr3 {
	uint8_t  cmd[4];   /* 1b 57 22 2e */
	uint8_t  unk[7];   /* 00 40 00 [...] */
	uint8_t  mode2;    /* 00 == normal, 01 == finedeep */
	uint8_t  null[38];
} __attribute__((packed));

/* Error policy? */
struct mitsu9550_hdr4 {
	uint8_t  cmd[4];   /* 1b 57 26 2e */
	uint8_t  unk[46];  /* 00 70 00 00 00 00 00 00 01 01 00 [...] */
} __attribute__((packed));

/* Data plane header */
struct mitsu9550_plane {
	uint8_t  cmd[4];     /* 1b 5a 54 XX */  /* XX == 0x10 if 16bpp, 0x00 for 8bpp */
	uint16_t col_offset; /* BE, normally 0, where we start dumping data */
	uint16_t row_offset; /* BE, normally 0, where we start dumping data */
	uint16_t cols;       /* BE */
	uint16_t rows;       /* BE */
} __attribute__((packed));

/* Command header */
struct mitsu9550_cmd {
	uint8_t cmd[4];
} __attribute__((packed));

/* Private data structure */
struct mitsu9550_printjob {
	struct dyesub_job_common common;

	uint8_t *databuf;
	uint32_t datalen;

	uint16_t rows;
	uint16_t cols;
	uint32_t plane_len;
	int is_raw;

	/* Parse headers separately */
	struct mitsu9550_hdr1 hdr1;
	int hdr1_present;
	struct mitsu9550_hdr2 hdr2;
	int hdr2_present;
	struct mitsu9550_hdr3 hdr3;
	int hdr3_present;
	struct mitsu9550_hdr4 hdr4;
	int hdr4_present;
};

struct mitsu9550_ctx {
	struct dyesub_connection *conn;

	int is_s;
	int is_98xx;
	int need_lib;
	int footer_len;
	const char *lut_fname;

	char fwver[7];  /* 6 + null */

	struct marker marker;

	/* CP98xx stuff */
	struct mitsu_lib lib;
	const struct mitsu98xx_data *m98xxdata;
};

/* Printer data structures */
#define CP9XXX_STS_x20     0x20
#define CP9XXX_STS_x21     0x21  /* struct mitsu9550_status2 */
#define CP9XXX_STS_x22     0x22
#define CP9XXX_STS_FWVER   0x23
#define CP9XXX_STS_MEDIA   0x24  /* struct mitsu9550_media */
#define CP9XXX_STS_x26     0x26
#define CP9XXX_STS_x30     0x30  /* struct mitsu9550_status */
#define CP9XXX_STS_x32     0x32  /* struct mitsucp30_status */

struct mitsu9550_media {
	uint8_t  hdr[2];  /* 24 2e */
	uint8_t  unk[12];
	uint8_t  type;
	uint8_t  unka[11];
	uint16_t unkb;    /* 0d 00 (CP9810), 00 00 (others?) */
	uint16_t max;     /* BE, prints per media */
	uint16_t remain2; /* BE, prints remaining  (CP30)*/
	uint16_t remain;  /* BE, prints remaining (Everything else) */
	uint8_t  unkc[14];
} __attribute__((packed));

struct mitsu9550_status {
	uint8_t  hdr[2]; /* 30 2e */
	uint8_t  null[4];
	uint8_t  sts1; // MM
	uint8_t  nullb[1];
	uint16_t copies; // BE, NN
	uint8_t  sts2; // ZZ  (9600 only?)
	uint8_t  nullc[5];
	uint8_t  sts3; // QQ
	uint8_t  sts4; // RR
	uint8_t  sts5; // SS
	uint8_t  nulld[25];
	uint8_t  sts6; // TT
	uint8_t  sts7; // UU
	uint8_t  nulle[2];
} __attribute__((packed));

struct mitsucp30_status {
	uint8_t  hdr[2]; /* 32 2e */
	uint8_t  zero[2];
	uint16_t serno[13]; /* UTF16, BE */
	uint8_t  sts;     /* CP30_STS_* */
	uint8_t  sts2;
	uint8_t  zerob;
	uint16_t err;     /* CP30_ERR_* */
	uint8_t  zeroc[2];
	uint8_t  remain;  /* on media */
	uint8_t  zerod[9];
} __attribute__((packed));

#define CP30_STS_IDLE     0x00
#define CP30_STS_PRINT    0x20

#define CP30_STS_PRINT_A  0x10  //Load
#define CP30_STS_PRINT_B  0x20  //Y
#define CP30_STS_PRINT_C  0x30  //M
#define CP30_STS_PRINT_D  0x40  //C
#define CP30_STS_PRINT_E  0x60  //Eject?

#define CP30_ERR_OK       0x0000
#define CP30_ERR_NOPC     0x0303
#define CP30_ERR_NORIBBON 0x0101
#define CP30_ERR_TRAYFULL 0x1404

struct mitsu9550_status2 {
	uint8_t  hdr[2]; /* 21 2e */
	uint8_t  unk[40];
	uint16_t remain; /* BE, media remaining */
	uint8_t  unkb[4]; /* 0a 00 00 01 */
} __attribute__((packed));

static int mitsu9550_main_loop(void *vctx, const void *vjob, int wait_for_return);

static const char *cp30_errors(uint16_t err)
{
	switch(err){
	case CP30_ERR_OK: return "None";
	case CP30_ERR_NOPC: return "No Paper Cassette";
	case CP30_ERR_NORIBBON: return "No Ribbon Loaded";
	case CP30_ERR_TRAYFULL: return "Output Tray Full";
	default: return "Unknown";
	}
}

static const char *cp30_media_types(uint16_t remain)
{
	switch(remain) {
	case 80: return "CK30S";
	case 50: return "CK30L";
	default: return "Unknown";
	}
}

#define CMDBUF_LEN   64
#define READBACK_LEN 128

#define QUERY_STATUS_I							\
	struct mitsu9550_status *sts = (struct mitsu9550_status*) rdbuf; \
	struct mitsucp30_status *sts30 = (struct mitsucp30_status*) rdbuf; \
	struct mitsu9550_media *media = (struct mitsu9550_media *) rdbuf; \
	uint16_t donor;							\
	/* media */							\
